### Задание 1
Импортируйте библиотеку Pandas и дайте ей псевдоним pd. Создайте датафрейм authors со столбцами author_id и author_name, в которых соответственно содержатся данные: [1, 2, 3] и ['Тургенев', 'Чехов', 'Островский'].
Затем создайте датафрейм book cо столбцами author_id, book_title и price, в которых соответственно содержатся данные: 
[1, 1, 1, 2, 2, 3, 3], 
['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
[450, 300, 350, 500, 450, 370, 290].

In [4]:
import pandas as pd
import numpy as np

In [5]:
authors = pd.DataFrame(np.array([[1, "Тургенев"], [2, "Чехов"], [3, "Островский"]]),
                   columns=["author_id", "author_name"])

In [6]:
authors

  author_id author_name
0         1    Тургенев
1         2       Чехов
2         3  Островский

In [7]:
book = pd.DataFrame(np.array([[1, "Отцы и дети", 450], [1, "Рудин", 300], [1, "Дворянское гнездо", 350],
                            [2, "Толстый и тонкий", 500], [2, "Дама с собачкой", 450],
                            [3, "Гроза", 370], [3, "Таланты и поклонники", 259]]),
                   columns=["author_id", "book_title", "price"])

In [8]:
book

  author_id            book_title price
0         1           Отцы и дети   450
1         1                 Рудин   300
2         1     Дворянское гнездо   350
3         2      Толстый и тонкий   500
4         2       Дама с собачкой   450
5         3                 Гроза   370
6         3  Таланты и поклонники   259

### Задание 2
Получите датафрейм authors_price, соединив датафреймы authors и books по полю author_id.

In [9]:
book["price"] = book["price"].astype(int)
authors_price = pd.merge(book, authors, left_on="author_id", right_on="author_id")
authors_price.drop(["author_id"], axis="columns", inplace=True)

In [10]:
authors_price

             book_title  price author_name
0           Отцы и дети    450    Тургенев
1                 Рудин    300    Тургенев
2     Дворянское гнездо    350    Тургенев
3      Толстый и тонкий    500       Чехов
4       Дама с собачкой    450       Чехов
5                 Гроза    370  Островский
6  Таланты и поклонники    259  Островский

### Задание 3
Создайте датафрейм top5, в котором содержатся строки из authors_price с пятью самыми дорогими книгами.

In [11]:
top5 = authors_price.sort_values(by="price", ascending=False).copy().head(5)

In [12]:
top5

          book_title  price author_name
3   Толстый и тонкий    500       Чехов
0        Отцы и дети    450    Тургенев
4    Дама с собачкой    450       Чехов
5              Гроза    370  Островский
2  Дворянское гнездо    350    Тургенев

### Задание 4
Создайте датафрейм authors_stat на основе информации из authors_price. В датафрейме authors_stat должны быть четыре столбца:
author_name, min_price, max_price и mean_price,
в которых должны содержаться соответственно имя автора,минимальная, максимальная и средняя цена на книги этого автора.

In [13]:
authors_stat = authors_price.groupby("author_name")["price"].agg([('Min' , 'min'), ('Max', 'max'), ('Mean', 'mean')])

In [14]:
authors_stat

             Min  Max        Mean
author_name
Островский   259  370  314.500000
Тургенев     300  450  366.666667
Чехов        450  500  475.000000

### Задание 5**
Создайте новый столбец в датафрейме authors_price под названием cover, в нем будут располагаться данные о том, какая обложка у данной книги - твердая или мягкая. В этот столбец поместите данные из следующего списка:
['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая'].
Просмотрите документацию по функции pd.pivot_table с помощью вопросительного знака.Для каждого автора посчитайте суммарную стоимость книг в твердой и мягкой обложке. Используйте для этого функцию pd.pivot_table. При этом столбцы должны называться "твердая" и "мягкая", а индексами должны быть фамилии авторов. Пропущенные значения стоимостей заполните нулями, при необходимости загрузите библиотеку Numpy.
Назовите полученный датасет book_info и сохраните его в формат pickle под названием "book_info.pkl". Затем загрузите из этого файла датафрейм и назовите его book_info2. Удостоверьтесь, что датафреймы book_info и book_info2 идентичны.

In [16]:
authors_price["cover"] = ["твердая","мягкая","мягкая","твердая","твердая","мягкая","мягкая"]

In [17]:
authors_price

             book_title  price author_name    cover
0           Отцы и дети    450    Тургенев  твердая
1                 Рудин    300    Тургенев   мягкая
2     Дворянское гнездо    350    Тургенев   мягкая
3      Толстый и тонкий    500       Чехов  твердая
4       Дама с собачкой    450       Чехов  твердая
5                 Гроза    370  Островский   мягкая
6  Таланты и поклонники    259  Островский   мягкая

In [18]:
book_info = pd.pivot_table(authors_price, values="price", index=["author_name"], columns=["cover"], aggfunc="sum")
book_info.fillna(0, axis=1, inplace=True)

In [19]:
book_info

cover        мягкая  твердая
author_name
Островский    629.0      0.0
Тургенев      650.0    450.0
Чехов           0.0    950.0

In [20]:
book_info.to_pickle("book_info.pkl")

In [21]:
book_info2 = pd.read_pickle("book_info.pkl")

In [22]:
book_info2

cover        мягкая  твердая
author_name
Островский    629.0      0.0
Тургенев      650.0    450.0
Чехов           0.0    950.0

## Совпадают